Revit 2026 API

# SchemaListFields Method

---

The complete list of fields in the Schema, sorted by name.

**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<Field> ListFields()
```
```vb
Public Function ListFields As IList(Of Field)
```
```cpp
public:
IList<Field^>^ ListFields()
```
```fsharp
member ListFields : unit -> IList<Field>
```

#### Return Value

IListField

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Reading of Entities of this Schema is not allowed to the current add-in. |

#### Reference

Schema Class

Autodesk.Revit.DB.ExtensibleStorage Namespace